samutronics/2026_0625_TM4C1294_MQTT_IO/mqtt_io/enet_io.c
    if(iSeqIdx < 0 || iDataIdx < 0)
    {
        return(DEFAULT_CGI_RESPONSE);
    }

    iSeqNum = (int32_t)ustrtoul(pcValue[iSeqIdx], NULL, 10);
    bLast   = (iLastIdx >= 0) && (pcValue[iLastIdx][0] == '1');
    pcData  = pcValue[iDataIdx];
    ui32DataHexLen = ustrlen(pcData) & ~1u; // must be even (pairs of hex chars)

    //
    // First chunk: reset state and pre-erase the header and first image page.
    //
    if(iSeqNum == 0)
    {
        g_ui32OTAWriteAddr    = OTA_IMAGE_ADDR;
        g_ui32OTASize         = 0;
        g_ui32OTAAlignLen     = 0;
        g_ui32OTALastErasedPage = OTA_IMAGE_ADDR;

        MAP_FlashErase(OTA_HEADER_ADDR);
        MAP_FlashErase(OTA_IMAGE_ADDR);

        UARTprintf("OTA: upload started.\n");
    }

    //
    // Decode hex bytes and write to staging flash in 4-byte aligned words.
    //
    for(i = 0; i < ui32DataHexLen; i += 2)
    {
        g_ui8OTAAlignBuf[g_ui32OTAAlignLen++] =
            (uint8_t)((HexNibble(pcData[i]) << 4) | HexNibble(pcData[i + 1]));
        g_ui32OTASize++;

        if(g_ui32OTAAlignLen == 4)
        {
            //
            // Erase the next 16 KB page when the write pointer first enters it.
            //
            ui32PageAddr = g_ui32OTAWriteAddr & ~(0x4000u - 1u);
            if(ui32PageAddr > g_ui32OTALastErasedPage)
            {
                MAP_FlashErase(ui32PageAddr);
                g_ui32OTALastErasedPage = ui32PageAddr;
            }

            MAP_FlashProgram((uint32_t *)(uintptr_t)g_ui8OTAAlignBuf,
                             g_ui32OTAWriteAddr, 4);
            g_ui32OTAWriteAddr += 4;
            g_ui32OTAAlignLen   = 0;
        }
    }

    //
    // Last chunk: flush any partial word (pad with 0xFF), then finalise.
    //
    if(bLast)
    {
        if(g_ui32OTAAlignLen > 0)
        {
            while(g_ui32OTAAlignLen < 4)
            {
                g_ui8OTAAlignBuf[g_ui32OTAAlignLen++] = 0xFF;
            }
            MAP_FlashProgram((uint32_t *)(uintptr_t)g_ui8OTAAlignBuf,
                             g_ui32OTAWriteAddr, 4);
            g_ui32OTAWriteAddr += 4;
            g_ui32OTAAlignLen   = 0;
        }

        //
        // CRC32 the staged image and write the header to 0x80000.
        //
        ui32Crc = ConfigCRC32((const uint8_t *)OTA_IMAGE_ADDR, g_ui32OTASize);

        sHdr.ui32Magic = OTA_HDR_MAGIC;
        sHdr.ui32Size  = g_ui32OTASize;
        sHdr.ui32CRC32 = ui32Crc;
        sHdr.ui32Rsvd  = 0;
        MAP_FlashProgram((uint32_t *)(uintptr_t)&sHdr,
                         OTA_HEADER_ADDR, sizeof(tOTAHeader));

        //
        // Set EEPROM pending flag so the next boot applies the update.
        //
        OtaSetPending(g_ui32OTASize);

        UARTprintf("OTA: %u bytes, CRC=0x%08x. Rebooting...\n",
                   g_ui32OTASize, ui32Crc);

        //
        // Signal the main loop to reset after the HTTP response is sent.
        //
        g_bOTAReset = true;
        return("/fwupdate_ok.shtml");
    }

    return("/fwupdate.shtml");
}

//*****************************************************************************
static int32_t
SSIHandler(int32_t iIndex, char *pcInsert, int32_t iInsertLen)
{
    tMQTTConfig *psCfg = ConfigGet();

    //
    // Which SSI tag have we been passed?  (The password is intentionally never
    // echoed back to the browser.)
    //
    switch(iIndex)
    {
        case SSI_INDEX_HOST:
            usnprintf(pcInsert, iInsertLen, "%s", psCfg->pcHost);
            break;

        case SSI_INDEX_PORT:
            usnprintf(pcInsert, iInsertLen, "%d", psCfg->ui16Port);
            break;

        case SSI_INDEX_CLIENT:
            usnprintf(pcInsert, iInsertLen, "%s", psCfg->pcClientID);
            break;

        case SSI_INDEX_USER:
            usnprintf(pcInsert, iInsertLen, "%s", psCfg->pcUser);
            break;

        case SSI_INDEX_TOPIC:
            usnprintf(pcInsert, iInsertLen, "%s", psCfg->pcTopicBase);
            break;

        case SSI_INDEX_DIN:
            usnprintf(pcInsert, iInsertLen, "%d", ConfigGetDinDevices());
            break;

        case SSI_INDEX_RELAY:
            usnprintf(pcInsert, iInsertLen, "%d", ConfigGetRelayDevices());
            break;

        case SSI_INDEX_AUTH:
            usnprintf(pcInsert, iInsertLen, "%s",
                      psCfg->ui8UseAuth ? "checked" : "");
            break;

        case SSI_INDEX_STATUS:
            usnprintf(pcInsert, iInsertLen, "%s", MQTTAppStatusStr());
            break;

        case SSI_INDEX_IP:
            usnprintf(pcInsert, iInsertLen, "%d.%d.%d.%d",
                      g_ui32IPAddress & 0xff, (g_ui32IPAddress >> 8) & 0xff,
                      (g_ui32IPAddress >> 16) & 0xff,
                      (g_ui32IPAddress >> 24) & 0xff);
            break;

        case SSI_INDEX_IOTYPES:
        {
            //
            // Emit one byte (2 hex chars) per DIN device, LSB = input 0 of
            // that device.  The I/O config page uses this to seed each select.
            //
            static const char pcHex[] = "0123456789abcdef";
            int iDin = (int)ConfigGetDinDevices();
            int iByte, iBit;
            int iPos = 0;
            for(iByte = 0; (iByte < iDin) && ((iPos + 2) < iInsertLen);
                iByte++)
            {
                uint8_t ui8Val = 0;
                for(iBit = 0; iBit < 8; iBit++)
                {
                    if(ConfigInputIsPushbutton(iByte * 8 + iBit))
                    {
                        ui8Val |= (uint8_t)(1u << iBit);
                    }
                }
                pcInsert[iPos++] = pcHex[(ui8Val >> 4) & 0xF];
                pcInsert[iPos++] = pcHex[ui8Val & 0xF];
            }
            pcInsert[iPos] = '\0';
            break;
        }

        case SSI_INDEX_IOBINDS:
        {
            //
            // Emit min(D*8, 16) inputs x 4 slots x 3 hex chars = up to 192 chars.
            // Per slot: 12-bit value = (output<<5)|(action<<3)|trigger as "XYZ".
            // "000" = unused slot.
            //
            static const char pcHexB[] = "0123456789abcdef";
            int iDin = (int)ConfigGetDinDevices();
            int iMaxIn = iDin * 8;
            int iInput, iSlot, iPos = 0;
            if(iMaxIn > 16) { iMaxIn = 16; }
            for(iInput = 0; (iInput < iMaxIn) && ((iPos + 3) < iInsertLen);
                iInput++)
            {
                for(iSlot = 0; (iSlot < CFG_BIND_SLOTS) &&
                               ((iPos + 3) < iInsertLen); iSlot++)
                {
                    uint8_t ta  = ConfigBindingGetTrigAct(iInput, iSlot);
                    uint8_t out = ConfigBindingGetOutput(iInput, iSlot);
                    uint16_t v  = 0;
                    if(((ta & 0x07u) != 0) && (out != BIND_OUTPUT_NONE))
                    {
                        v = (uint16_t)(((uint16_t)out << 5) | (ta & 0x1Fu));
                    }
                    pcInsert[iPos++] = pcHexB[(v >> 8) & 0xFu];
                    pcInsert[iPos++] = pcHexB[(v >> 4) & 0xFu];
                    pcInsert[iPos++] = pcHexB[v & 0xFu];
                }
            }
            pcInsert[iPos] = '\0';
            break;
        }

