samutronics/2026_0625_TM4C1294_MQTT_IO/mqtt_io/enet_io.c
        case SSI_INDEX_FWVER:
        {
            //
            // Build timestamp formatted as YYYYMMDDHHMM from __DATE__ and
            // __TIME__ (both are compile-time string literals).
            //
            // __DATE__ = "Mon DD YYYY"  e.g. "Jul 11 2026"  (space-padded day)
            // __TIME__ = "HH:MM:SS"     e.g. "09:23:45"
            //
            static const char pcMons[] =
                "JanFebMarAprMayJunJulAugSepOctNovDec";
            const char *pd = __DATE__;
            const char *pt = __TIME__;
            int iMon, iDay, iYear, iHour, iMin;

            for(iMon = 0; iMon < 12; iMon++)
            {
                if((pd[0] == pcMons[iMon * 3]) &&
                   (pd[1] == pcMons[iMon * 3 + 1]) &&
                   (pd[2] == pcMons[iMon * 3 + 2]))
                {
                    break;
                }
            }
            iMon++;
            iDay  = ((pd[4] == ' ') ? 0 : (pd[4] - '0')) * 10 + (pd[5] - '0');
            iYear = (pd[7]-'0')*1000 + (pd[8]-'0')*100 +
                    (pd[9]-'0')*10   + (pd[10]-'0');
            iHour = (pt[0]-'0')*10 + (pt[1]-'0');
            iMin  = (pt[3]-'0')*10 + (pt[4]-'0');

            usnprintf(pcInsert, iInsertLen, "%04d%02d%02d%02d%02d",
                      iYear, iMon, iDay, iHour, iMin);
            break;
        }

        default:
            usnprintf(pcInsert, iInsertLen, "??");
            break;
    }

    //
    // Tell the server how many characters our insert string contains.
    //
    return(strlen(pcInsert));
}

//*****************************************************************************
//
// The interrupt handler for the SysTick interrupt.
//
//*****************************************************************************
void
SysTickIntHandler(void)
{
    //
    // Call the lwIP timer handler.
    //
    lwIPTimer(SYSTICKMS);

    //
    // Flag a periodic application tick for the main loop (MQTT keep-alive /
    // reconnect service).
    //
    g_bSysTickFlag = true;
}

//*****************************************************************************
//
// The interrupt handler for the timer used to pace the animation.
//
//*****************************************************************************
void
AnimTimerIntHandler(void)
{
    //
    // Clear the timer interrupt.
    //
    MAP_TimerIntClear(TIMER2_BASE, TIMER_TIMA_TIMEOUT);

    //
    // Indicate that a timer interrupt has occurred.
    //
    HWREGBITW(&g_ulFlags, FLAG_TICK) = 1;
}

//*****************************************************************************
//
// Display an lwIP type IP Address.
//
//*****************************************************************************
void
DisplayIPAddress(uint32_t ui32Addr)
{
    char pcBuf[16];

    //
    // Convert the IP Address into a string.
    //
    usprintf(pcBuf, "%d.%d.%d.%d", ui32Addr & 0xff, (ui32Addr >> 8) & 0xff,
            (ui32Addr >> 16) & 0xff, (ui32Addr >> 24) & 0xff);

    //
    // Display the string.
    //
    UARTprintf(pcBuf);
}

//*****************************************************************************
//
// Required by lwIP library to support any host-related timer functions.
//
//*****************************************************************************
void
lwIPHostTimerHandler(void)
{
    uint32_t ui32NewIPAddress;

    //
    // Get the current IP address.
    //
    ui32NewIPAddress = lwIPLocalIPAddrGet();

    //
    // See if the IP address has changed.
    //
    if(ui32NewIPAddress != g_ui32IPAddress)
    {
        //
        // See if there is an IP address assigned.
        //
        if(ui32NewIPAddress == 0xffffffff)
        {
            //
            // Indicate that there is no link.
            //
            UARTprintf("Waiting for link.\n");
        }
        else if(ui32NewIPAddress == 0)
        {
            //
            // There is no IP address, so indicate that the DHCP process is
            // running.
            //
            UARTprintf("Waiting for IP address.\n");
        }
        else
        {
            //
            // Display the new IP address.
            //
            UARTprintf("IP Address: ");
            DisplayIPAddress(ui32NewIPAddress);
            UARTprintf("\n");
            UARTprintf("Open a browser and enter the IP address.\n");

            //
            // We now have network connectivity: ask the main loop to bring up
            // the MQTT connection (if a broker has been configured).
            //
            g_bStartMQTT = true;
        }

        //
        // Save the new IP address.
        //
        g_ui32IPAddress = ui32NewIPAddress;
    }

    //
    // If there is not an IP address.
    //
    if((ui32NewIPAddress == 0) || (ui32NewIPAddress == 0xffffffff))
    {
        //
        // Do nothing and keep waiting.
        //
    }
}

//*****************************************************************************
//
// Apply all binding slots for one input that match the given trigger event.
// Each matching slot sets a relay and publishes its new retained state.
//
//*****************************************************************************
static void
ApplyBindings(int iInput, uint8_t ui8Trig)
{
    int iSlot;

    for(iSlot = 0; iSlot < CFG_BIND_SLOTS; iSlot++)
    {
        uint8_t ta  = ConfigBindingGetTrigAct(iInput, iSlot);
        uint8_t out = ConfigBindingGetOutput(iInput, iSlot);
        uint8_t trig = ta & 0x07u;
        uint8_t act  = (ta >> 3) & 0x03u;
        bool bOn;

        if((trig != ui8Trig) || (out == BIND_OUTPUT_NONE) ||
           (out >= (uint8_t)RelayChainCount()))
        {
            continue;
        }

        if(act == BIND_ACT_ON)
        {
            bOn = true;
        }
        else if(act == BIND_ACT_OFF)
        {
            bOn = false;
        }
        else
        {
            bOn = !RelayChainGet(out);
        }

        UARTprintf("Bind: in%d trig%d -> relay%d %s\n",
                   iInput, ui8Trig, out, bOn ? "ON" : "OFF");
        MQTTAppSetRelay(out, bOn);
    }
}

//*****************************************************************************
//
// Click-event callback: publish the HA event and apply any binding.
//
//*****************************************************************************
static void
IEClickCallback(int iInput, const char *pcEvt)
{
    uint8_t ui8Trig;

    MQTTAppPublishInputEvent(iInput, pcEvt);

    ui8Trig = (pcEvt[0] == 's') ? BIND_TRIG_SINGLE : BIND_TRIG_DOUBLE;
    ApplyBindings(iInput, ui8Trig);
}

//*****************************************************************************
//
// Poll the SN65HVS882 input chain and log any change over UART.  Called from
// the periodic application tick.  This is bring-up instrumentation - MQTT
// publishing of the inputs will hook in here next.
//
//*****************************************************************************
static void
DINChainScan(void)
{
    static uint8_t pui8Prev[DIN_MAX_BYTES];
    static bool bPrimed;
    uint8_t pui8Cur[DIN_MAX_BYTES];
    uint8_t ui8Bytes, i;

    ui8Bytes = DINChainRead(pui8Cur, sizeof(pui8Cur));
    if(ui8Bytes == 0)
    {
        return;
    }

    //
    // Process each input.  Channel c of device d maps to bit (7-c) of byte d
    // and to input index d*8+c.
    //
    // Pushbutton inputs: feed the current level to the click-detector every
    // scan (the FSM needs a continuous level signal for debounce).
    //
    // Switch inputs: detect edges vs the previous scan and publish ON/OFF.
    // The first scan only primes the baseline; initial retained states are
    // published by the MQTT post-connect sequence.
    //
    for(i = 0; i < ui8Bytes; i++)
    {
        uint8_t ui8Diff = (uint8_t)(pui8Cur[i] ^ pui8Prev[i]);
        int iBit;

        for(iBit = 0; iBit < 8; iBit++)
        {
            uint8_t ui8Mask = (uint8_t)(0x80 >> iBit);
            int iInput = (i * 8) + iBit;
            bool bActive = (pui8Cur[i] & ui8Mask) != 0;

            if(ConfigInputIsPushbutton(iInput))
            {
                InputEventsUpdate(iInput, bActive);
            }
            else if(bPrimed && (ui8Diff & ui8Mask))
            {
                UARTprintf("DIN in%d: %s\n", iInput, bActive ? "ON" : "OFF");
                MQTTAppPublishInput(iInput, bActive);
                ApplyBindings(iInput,
                              bActive ? BIND_TRIG_LEVEL_ON : BIND_TRIG_LEVEL_OFF);
            }
        }
        pui8Prev[i] = pui8Cur[i];
    }
    bPrimed = true;
}

//*****************************************************************************
//
// Log DRV8860 nFAULT transitions (overcurrent / over-temperature / open-load).
//
//*****************************************************************************
static void
RelayFaultScan(void)
{
    static bool bPrevFault;
    bool bFault = RelayChainFault();

    if(bFault != bPrevFault)
    {
        UARTprintf("Relay nFAULT %s\n", bFault ? "ASSERTED" : "cleared");
        bPrevFault = bFault;
    }
}

//*****************************************************************************
//
// This application uses the Ethernet controller and lwIP TCP/IP stack to
// implement a web-configurable MQTT node.  Broker parameters are set via an
// on-board web page; the control board's field I/O is exposed over MQTT.
//
//*****************************************************************************
int
main(void)

{
    uint32_t ui32User0, ui32User1;
    uint8_t pui8MACArray[8];

    //
    // Make sure the main oscillator is enabled because this is required by
    // the PHY.  The system must have a 25MHz crystal attached to the OSC
    // pins.  The SYSCTL_MOSC_HIGHFREQ parameter is used when the crystal
    // frequency is 10MHz or higher.
    //
    SysCtlMOSCConfigSet(SYSCTL_MOSC_HIGHFREQ);

    //
    // Run from the PLL at 120 MHz.
    // Note: SYSCTL_CFG_VCO_240 is a new setting provided in TivaWare 2.2.x and
    // later to better reflect the actual VCO speed due to SYSCTL#22.
    //
    g_ui32SysClock = MAP_SysCtlClockFreqSet((SYSCTL_XTAL_25MHZ |
                                             SYSCTL_OSC_MAIN |
                                             SYSCTL_USE_PLL |
                                             SYSCTL_CFG_VCO_240), 120000000);

    //
    // Configure the device pins.
    //
    PinoutSet(true, false);

    //
    // Configure debug port for internal use.
    //
    UARTStdioConfig(0, 115200, g_ui32SysClock);

    //
    // Clear the terminal and print a banner.
    //
    UARTprintf("\033[2J\033[H");
    UARTprintf("TM4C1294 MQTT IO\n\n");

    //
    // Load persistent MQTT configuration from EEPROM.
    //
    ConfigInit();

    //
    // If a firmware update was staged before the last reset, validate it and
    // apply it now (OtaCheckAndApply calls OtaApply which never returns).
    //
    OtaCheckAndApply();

    //
    // Configure SysTick for a periodic interrupt.
    //
    MAP_SysTickPeriodSet(g_ui32SysClock / SYSTICKHZ);
    MAP_SysTickEnable();
    MAP_SysTickIntEnable();

    //
    // Configure the hardware MAC address for Ethernet Controller filtering of
    // incoming packets.  The MAC address will be stored in the non-volatile
    // USER0 and USER1 registers.
    //
    MAP_FlashUserGet(&ui32User0, &ui32User1);
    if((ui32User0 == 0xffffffff) || (ui32User1 == 0xffffffff))
    {
        //
        // Let the user know there is no MAC address
        //
        UARTprintf("No MAC programmed!\n");

        while(1)
        {
        }
    }

    //
    // Tell the user what we are doing just now.
    //
    UARTprintf("Waiting for IP.\n");

    //
    // Convert the 24/24 split MAC address from NV ram into a 32/16 split
    // MAC address needed to program the hardware registers, then program
    // the MAC address into the Ethernet Controller registers.
    //
    pui8MACArray[0] = ((ui32User0 >>  0) & 0xff);
    pui8MACArray[1] = ((ui32User0 >>  8) & 0xff);
    pui8MACArray[2] = ((ui32User0 >> 16) & 0xff);
    pui8MACArray[3] = ((ui32User1 >>  0) & 0xff);
    pui8MACArray[4] = ((ui32User1 >>  8) & 0xff);
    pui8MACArray[5] = ((ui32User1 >> 16) & 0xff);

    //
    // Initialize the lwIP library, using DHCP.
    //
    lwIPInit(g_ui32SysClock, pui8MACArray, 0, 0, 0, IPADDR_USE_DHCP);

    //
    // Setup the device locator service.
    //
    LocatorInit();
    LocatorMACAddrSet(pui8MACArray);
    LocatorAppTitleSet("EK-TM4C1294XL MQTT IO");

    //
    // Initialize a sample httpd server.
    //
    httpd_init();

    //
    // Set the interrupt priorities.  We set the SysTick interrupt to a higher
    // priority than the Ethernet interrupt to ensure that the file system
    // tick is processed if SysTick occurs while the Ethernet handler is being
    // processed.  This is very likely since all the TCP/IP and HTTP work is
    // done in the context of the Ethernet interrupt.
    //
    MAP_IntPrioritySet(INT_EMAC0, ETHERNET_INT_PRIORITY);
    MAP_IntPrioritySet(FAULT_SYSTICK, SYSTICK_INT_PRIORITY);

    //
    // Pass our tag information to the HTTP server.
    //
    http_set_ssi_handler((tSSIHandler)SSIHandler, g_pcConfigSSITags,
            NUM_CONFIG_SSI_TAGS);

    //
    // Pass our CGI handlers to the HTTP server.
    //
    http_set_cgi_handlers(g_psConfigCGIURIs, NUM_CONFIG_CGI_URIS);

    //
    // Initialize IO controls (legacy web-demo LED / animation timer).
    //
    io_init();

    //
    // Initialize the field-I/O chains with the configured device counts.  The
    // relay chain powers up with all relays off and outputs enabled.
    //
    DINChainInit(ConfigGetDinDevices());
    RelayChainInit(ConfigGetRelayDevices());
    UARTprintf("IO: %d input dev, %d relay dev.\n", ConfigGetDinDevices(),
               ConfigGetRelayDevices());

    //
    // Initialize the MQTT client subsystem (MAC seeds the HA device id).
    //
    MQTTAppInit(pui8MACArray);

    //
    // Wire the pushbutton click callback to the MQTT event publisher.
    //
    InputEventsSetCallback(IEClickCallback);

    //
    // Main loop.  Networking (lwIP, httpd, MQTT receive) runs in interrupt
    // context; here we service the periodic application tick: apply pending
    // (re)connect requests and drive the MQTT keep-alive/reconnect timers.
    //
    while(1)
    {
        //
        // If the OTA last-chunk handler requested a reset, wait one tick so
        // the HTTP response is delivered, then reset into the new firmware.
        //
        if(g_bOTAReset)
        {
            g_bOTAReset = false;
            MAP_SysCtlDelay(g_ui32SysClock / 3);  // ~333 ms — let TCP flush
            MAP_SysCtlReset();
        }

        //
        // Wait for the next SysTick (~10 ms) application tick.
        //
        while(!g_bSysTickFlag)
        {
        }
        g_bSysTickFlag = false;

        //
        // Apply a pending (re)connect request from DHCP completion or a web
        // configuration change.
        //
        if(g_bStartMQTT)
        {
            g_bStartMQTT = false;
            //
            // A config change may also have altered the device counts.  Only
            // reconfigure the relay chain when its count actually changed, so an
            // unrelated setting change does not switch the relays off.
            //
            DINChainSetDevices(ConfigGetDinDevices());
            if(RelayChainGetDevices() != ConfigGetRelayDevices())
            {
                RelayChainSetDevices(ConfigGetRelayDevices());
            }
            MQTTAppStart();
        }

        //
        // Re-publish HA discovery after an I/O configuration change (without
        // a full reconnect — the broker session stays live).
        //
        if(g_bRepublishMQTT)
        {
            g_bRepublishMQTT = false;
            MQTTAppRepublish();
        }

        //
        // Poll the input chain and the relay fault line; log any transitions.
        //
        DINChainScan();
        RelayFaultScan();

        //
        // Advance pushbutton click-detection timers.
        //
        InputEventsTick(SYSTICKMS);

        //
        // Service MQTT keep-alive, reconnect timers and the post-connect
        // publish sequence.
        //
        MQTTAppTick(SYSTICKMS);
    }
}
